app/controllers/clearance/users_controller.rb

SELECT * FROM `users`
SELECT * FROM `user_invites`
---
  def index
    @users = ::User.all
    @user_invites = ::UserInvite.all

INSERT INTO `users` (`encrypted_password`, `salt`, `created_at`, `updated_at`, `remember_token`, `confirmation_token`, `email_confirmed`, `email`) VALUES('0351efbbd29edde2b27a95c365192e3f4804d1ab', '982e5be9d0c9ed8f8dacdf9560109ca8a50259a3', '2009-12-05 17:36:00', '2009-12-05 17:36:00', NULL, 'd3ac07b04f31959e9f41dc5c7bf62d3c07642845', 0, 'chris@hotink.net')
---
  def create
    @user = ::User.new params[:user]
    if @user.save