app/controllers/consumers_controller.rb

SELECT * FROM `consumers`
---
  def index
    @consumers = Consumer.all

INSERT INTO `consumers` (`label`, `created_at`, `updated_at`, `url`) VALUES('Galileo Dev', '2009-12-08 23:59:44', '2009-12-08 23:59:44', 'http://localhost:3001/sso/login')
---
  def create
    @consumer = Consumer.new(params[:consumer])

    if @consumer.save

SELECT * FROM `consumers` WHERE (`consumers`.`id` = 162)
DELETE FROM `consumers` WHERE `id` = 162
---
  def destroy
    @consumer = Consumer.find(params[:id])
    @consumer.destroy