app/controllers/users_controller.rb

SELECT * FROM `users`
SELECT * FROM `user_invites`
---
  def index
    @users = ::User.all
    @user_invites = ::UserInvite.all

INSERT INTO `user_invites` (`created_at`, `invited_at`, `redeemed_at`, `updated_at`, `invite_code`, `email`) VALUES('2009-12-06 23:21:42', NULL, NULL, '2009-12-06 23:21:42', NULL, 'user7@example.com')
INSERT INTO `users` (`encrypted_password`, `salt`, `updated_at`, `remember_token`, `confirmation_token`, `email`, `email_confirmed`, `created_at`) VALUES('fdee89bb82800d0a943ba38be507468f10fcbdf8', 'a6c83559c43f97d7a6218ef24c2602096bc8a068', '2009-12-07 14:42:12', NULL, '4b389167c9222fcd2188ca605a222a1b9dd230ed', 'user19@example.com', 0, '2009-12-07 14:42:12')
---
  def create
      @user = User.new params[:user]
      @user.invite_code = params[:invite_code]
      if @user.save