app/controllers/user_invites_controller.rb

  def create
    @user_invite = UserInvite.new(params[:user_invite])

    respond_to do |format|
      if @user_invite.save
---
INSERT INTO `user_invites` (`updated_at`, `invited_at`, `redeemed_at`, `invite_code`, `email`, `created_at`) VALUES('2009-12-08 15:08:42', NULL, NULL, NULL, 'user37@example.com', '2009-12-08 15:08:42')